var manual = {
    '레이드' : '포고봇 레이드 관련 설명\n제보 포맷: "12:30 사과 제보" or "사과 12시30분 제보" 등 시간과 장소(체육관명)과 제보 이 3가지가 충족이 되면 반응해요!\n만약 제보가 잘못되었다면, "사과 오보", "사과 삭제해줘" 등으로 말하시면 바로 지울게요!\n제가 알아서 시간이 지난 레이드는 지우지만, 만약 안지워졌다면 "사과 만료" 나 "사과 끝났어" 등으로 말해주세요!',
    '정보' : '"도리야 가이오가 백개체" 등 도리야를 붙여서 불러주세요! 파이어 이벤트나, 다가오는 커뮤니티데이, 마기라스 레이드 성공기준, 둥지 정보, 지역락 포켓몬, 미스틱 평가 대사 등 이것저것 알려드릴게요! 제가 만약 모르는 정보라면 기억 해두었다가 알아올게요!',
    '명령어' : '레이드: __시__분 (체육관명) 제보\n레이드 삭제: (체육관명) 삭제\n그 외: 도리야 + 명령어'
};


var ttikku = {
    1 : '띠꾸혀엉',
    2 : '띠꾸혀어엉',
    3 : '띠꾸혀어어엉',
    4 : '띠꾸혀어어어엉',
    5 : '띠꾸혀어어어어엉',
    6 : '띠꾸혀어어어어어엉',
    7 : '띠꾸혀엉...',
    8 : '띠꾸혀어엉...',
    9 : '노래도잘하는띠꾸혀엉',
    10 : '띠꾸띠꾸씰',
    11 : '원숭이띠꾸혀엉',
    12 : '띠꾸혀어어어어어어어어어어어어어어어어어어엉',
    13 : '딥-띠꾸',
    14 : '빛-띠꾸',
    15 : '띠꾸혀어엉이구나',
    16 : '띠꾸혀어어엉!!',
    17 : '원로띠꾸혀엉',
    18 : '뉴발신는띠꾸혀어엉',
    19 : '띠꾸혀어엉',
    20 : '어디에나있는띠끄혀어엉...',
    21 : '부기띠끄',
    22 : '띠끄혀어엉',
    23 : '부띠끄',
    24 : '티꾸혀어엉',
    25 : '티꾸',
    26 : '티꾸혀어엉의',
    27 : '티꾸티꾸씰ㅋㅋㅋㅋㅋㅋㅋ',
    28 : '티꾸라파닭',
    29 : '티꾸닭',
    30 : '티꾸혀엉',
    31 : '티꾸다',
    32 : '띠꾸혀어어어어어엉',
    33 : '띠꾸혀어어엉',
    34 : '띠꾸혀어어어어어엉',
    35 : '띠꾸혀어어엉',
    36 : '띠꾸형!',
    37 : '미스티꾸',
    38 : '미스티꾸혀엉',
    39 : '하입님.',
    40 : '띠꾸혀어어어어어엉'
};



var ranDict = Math.floor((Math.random() * 3) + 1);

var d = '08';
var e = parseInt(d);

console.log(e);



var monDict =  {
    1 : "덕분에 레이드 잘 했어요 - mon12",
    2 : "으아아아아아 아빠 나 물짱이!!!! 으아아아아!!! -mon12"
};